app/controllers/multiplechoices_controller.rb

  def index
    @multiplechoices = Multiplechoice.all
---
SELECT * FROM `multiplechoices`

  def show
    @multiplechoice = Multiplechoice.find(params[:id])
---
SELECT * FROM `multiplechoices` WHERE (`multiplechoices`.`id` = 1)

  def edit
    @multiplechoice = Multiplechoice.find(params[:id])
---
SELECT * FROM `multiplechoices` WHERE (`multiplechoices`.`id` = 1)

  def create
    @multiplechoice = Multiplechoice.new(params[:multiplechoice])

    respond_to do |format|
      if @multiplechoice.save
---
INSERT INTO `multiplechoices` (`choice3`, `choice4`, `updated_at`, `correctChoice`, `rate`, `question`, `choice1`, `choice2`, `created_at`) VALUES('cesz', 'nicole', '2010-09-01 03:50:57', 3, 'hard', 'name?', 'kim', 'amelia', '2010-09-01 03:50:57')

  def destroy
    @multiplechoice = Multiplechoice.find(params[:id])
    @multiplechoice.destroy
---
SELECT * FROM `multiplechoices` WHERE (`multiplechoices`.`id` = 2)
DELETE FROM `multiplechoices` WHERE `id` = 2