app/controllers/quizreport_controller.rb

SELECT min(`student_grades`.grade) AS min_grade FROM `student_grades`
---
  def index
    @gradeaverage = StudentGrade.average(:grade)