app/controllers/quizfinals_controller.rb

SELECT * FROM `quizfinals`
---
  def index
    @quizfinals = Quizfinal.all

SELECT * FROM `quizfinals` WHERE (`quizfinals`.`id` = 1)
---
  def show
    @quizfinal = Quizfinal.find(params[:id])

SELECT * FROM `quizfinals` WHERE (`quizfinals`.`id` = 2)
---
  def edit
    @quizfinal = Quizfinal.find(params[:id])

INSERT INTO `quizfinals` (`updated_at`, `enddate`, `faculty`, `timer`, `quiztype`, `section`, `startdate`, `created_at`) VALUES('2010-09-01 07:37:16', '2010-09-03', 'ako', '21', 'multiple choice', 'S14', '2010-09-02', '2010-09-01 07:37:16')
---
  def create
    @quizfinal = Quizfinal.new(params[:quizfinal])

    respond_to do |format|
      if @quizfinal.save

SELECT * FROM `quizfinals` WHERE (`quizfinals`.`id` = 2)
UPDATE `quizfinals` SET `updated_at` = '2010-09-01 16:10:11', `quiztype` = 'multiple choice' WHERE `id` = 6
---
  def update
    @quizfinal = Quizfinal.find(params[:id])

    respond_to do |format|
      if @quizfinal.update_attributes(params[:quizfinal])

SELECT * FROM `quizfinals` WHERE (`quizfinals`.`id` = 1)
DELETE FROM `quizfinals` WHERE `id` = 1
---
  def destroy
    @quizfinal = Quizfinal.find(params[:id])
    @quizfinal.destroy