app/controllers/trueorfalses_controller.rb

  def index
    @trueorfalses = Trueorfalse.all
---
SELECT * FROM `trueorfalses`

  def show
    @trueorfalse = Trueorfalse.find(params[:id])
---
SELECT * FROM `trueorfalses` WHERE (`trueorfalses`.`id` = 1)

  def edit
    @trueorfalse = Trueorfalse.find(params[:id])
---
SELECT * FROM `trueorfalses` WHERE (`trueorfalses`.`id` = 1)

  def create
    @trueorfalse = Trueorfalse.new(params[:trueorfalse])

    respond_to do |format|
      if @trueorfalse.save
---
INSERT INTO `trueorfalses` (`answer`, `updated_at`, `rate`, `question`, `created_at`) VALUES('False', '2010-09-01 17:59:05', 'Easy', 'I am gay', '2010-09-01 17:59:05')